Revit 2024 API
IFCExportOptions Methods
The IFCExportOptions type exposes the following members.
Methods
Name | Description
AddOption
 Adds a new named option to the options structure.
Assign
 Assigns the values of the IFCExportOptions to this options object.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
IFCExportOptions Class
Autodesk.Revit.DB Namespace